In [1]:
import pandas as pd
from splinter import Browser
from bs4 import BeautifulSoup as bs
from webdriver_manager.chrome import ChromeDriverManager

In [2]:
url = 'https://en.m.wikipedia.org/wiki/Oprah%27s_Book_Club'

In [3]:
tables = pd.read_html(url)
tables

[              Date                                     Title  \
 0   September 1996                 The Deep End of the Ocean
 1     October 1996                           Song of Solomon
 2    November 1996                          The Book of Ruth
 3    December 1996                         She's Come Undone
 4    February 1997                     Stones from the River
 ..             ...                                       ...
 62    January 2008                               A New Earth
 63  September 2008               The Story of Edgar Sawtelle
 64  September 2009                    Say You're One of Them
 65  September 2010                                   Freedom
 66   December 2010  Great Expectations, A Tale of Two Cities

                 Author Reference
 0   Jacquelyn Mitchard       NaN
 1        Toni Morrison       NaN
 2        Jane Hamilton       NaN
 3           Wally Lamb       NaN
 4          Ursula Hegi       NaN
 ..                 ...       ...
 62       Eckhart Tolle       NaN
 63    David Wroblewski      [27]
 64          Uwem Akpan       NaN
 65    Jonathan Franzen       NaN
 66     Charles Dickens       NaN

 [67 rows x 4 columns]]

In [4]:
df = tables[0]
#df.columns = ['Date', 'Title', 'Author']
df

,Date,Title,Author,Reference
0,September 1996,The Deep End of the Ocean,Jacquelyn Mitchard,NaN
1,October 1996,Song of Solomon,Toni Morrison,NaN
2,November 1996,The Book of Ruth,Jane Hamilton,NaN
3,December 1996,She's Come Undone,Wally Lamb,NaN
4,February 1997,Stones from the River,Ursula Hegi,NaN
...,...,...,...,...
62,January 2008,A New Earth,Eckhart Tolle,NaN
63,September 2008,The Story of Edgar Sawtelle,David Wroblewski,[27]
64,September 2009,Say You're One of Them,Uwem Akpan,NaN
65,September 2010,Freedom,Jonathan Franzen,NaN
66,December 2010,"Great Expectations, A Tale of Two Cities",Charles Dickens,NaN

In [5]:
new_df = df.drop(columns=['Reference'])

new_df

,Date,Title,Author
0,September 1996,The Deep End of the Ocean,Jacquelyn Mitchard
1,October 1996,Song of Solomon,Toni Morrison
2,November 1996,The Book of Ruth,Jane Hamilton
3,December 1996,She's Come Undone,Wally Lamb
4,February 1997,Stones from the River,Ursula Hegi
...,...,...,...
62,January 2008,A New Earth,Eckhart Tolle
63,September 2008,The Story of Edgar Sawtelle,David Wroblewski
64,September 2009,Say You're One of Them,Uwem Akpan
65,September 2010,Freedom,Jonathan Franzen
66,December 2010,"Great Expectations, A Tale of Two Cities",Charles Dickens

In [6]:
url_2 = 'https://en.m.wikipedia.org/wiki/Oprah%27s_Book_Club_2.0'

In [7]:
tables = pd.read_html(url_2)
tables

[  Oprah's Book Club 2.0                     Oprah's Book Club 2.0.1
 0                   NaN                                         NaN
 1          Sponsored by  Oprah Winfrey NetworkO: The Oprah Magazine
 2              Location                                   Worldwide
 3          Presented by                               Oprah Winfrey
 4         First awarded                                        2012
 5               Website                                     Website,
               Date                Author  \
 0        June 2012        Cheryl Strayed
 1    December 2012          Ayana Mathis
 2     January 2014         Sue Monk Kidd
 3    February 2015          Cynthia Bond
 4      August 2016      Colson Whitehead
 5   September 2016  Glennon Doyle Melton
 6        June 2017           Imbolo Mbue
 7    February 2018          Tayari Jones
 8        June 2018    Anthony Ray Hinton
 9    November 2018        Michelle Obama
 10  September 2019      Ta-Nehisi Coates
 11   November 2019      Elizabeth Strout

                                                 Title Citation
 0   Wild: From Lost to Found on the Pacific Crest ...      [1]
 1                         The Twelve Tribes of Hattie   [6][7]
 2                              The Invention of Wings      [8]
 3                                                Ruby      [9]
 4                            The Underground Railroad     [10]
 5                                        Love Warrior     [11]
 6                                 Behold the Dreamers     [12]
 7                                An American Marriage     [13]
 8                                  The Sun Does Shine     [14]
 9                                            Becoming     [15]
 10                                   The Water Dancer     [16]
 11                                       Olive, Again     [17]  ]

In [8]:
df2 = tables[1]
df2

,Date,Author,Title,Citation
0,June 2012,Cheryl Strayed,Wild: From Lost to Found on the Pacific Crest ...,[1]
1,December 2012,Ayana Mathis,The Twelve Tribes of Hattie,[6][7]
2,January 2014,Sue Monk Kidd,The Invention of Wings,[8]
3,February 2015,Cynthia Bond,Ruby,[9]
4,August 2016,Colson Whitehead,The Underground Railroad,[10]
5,September 2016,Glennon Doyle Melton,Love Warrior,[11]
6,June 2017,Imbolo Mbue,Behold the Dreamers,[12]
7,February 2018,Tayari Jones,An American Marriage,[13]
8,June 2018,Anthony Ray Hinton,The Sun Does Shine,[14]
9,November 2018,Michelle Obama,Becoming,[15]
10,September 2019,Ta-Nehisi Coates,The Water Dancer,[16]
11,November 2019,Elizabeth Strout,"Olive, Again",[17]

In [9]:
new_df2 = df2.drop(columns=['Citation'])
new_df2

,Date,Author,Title
0,June 2012,Cheryl Strayed,Wild: From Lost to Found on the Pacific Crest ...
1,December 2012,Ayana Mathis,The Twelve Tribes of Hattie
2,January 2014,Sue Monk Kidd,The Invention of Wings
3,February 2015,Cynthia Bond,Ruby
4,August 2016,Colson Whitehead,The Underground Railroad
5,September 2016,Glennon Doyle Melton,Love Warrior
6,June 2017,Imbolo Mbue,Behold the Dreamers
7,February 2018,Tayari Jones,An American Marriage
8,June 2018,Anthony Ray Hinton,The Sun Does Shine
9,November 2018,Michelle Obama,Becoming
10,September 2019,Ta-Nehisi Coates,The Water Dancer
11,November 2019,Elizabeth Strout,"Olive, Again"

In [10]:
#merged_df = pd.merge()

frames = [new_df, new_df2]

oprah = pd.concat(frames)

oprah = oprah.drop(columns=['Author'])



oprah

              Date                      Title
0   September 1996  The Deep End of the Ocean
1     October 1996            Song of Solomon
2    November 1996           The Book of Ruth
3    December 1996          She's Come Undone
4    February 1997      Stones from the River
..             ...                        ...
7    February 2018       An American Marriage
8        June 2018         The Sun Does Shine
9    November 2018                   Becoming
10  September 2019           The Water Dancer
11   November 2019               Olive, Again

[79 rows x 2 columns]

In [11]:
oprah['Year'] = pd.DatetimeIndex(oprah['Date']).year
oprah['Month'] = pd.DatetimeIndex(oprah['Date']).month
oprah = oprah.drop(columns=['Date'])


oprah.head()

                       Title  Year  Month
0  The Deep End of the Ocean  1996      9
1            Song of Solomon  1996     10
2           The Book of Ruth  1996     11
3          She's Come Undone  1996     12
4      Stones from the River  1997      2

In [12]:
#oprah.to_dict()

oprah_dict = oprah.set_index('Title').T.to_dict('list')

oprah_dict

{'The Deep End of the Ocean': [1996, 9],
 'Song of Solomon': [1996, 10],
 'The Book of Ruth': [1996, 11],
 "She's Come Undone": [1996, 12],
 'Stones from the River': [1997, 2],
 'The Rapture of Canaan': [1997, 4],
 'The Heart of a Woman': [1997, 5],
 'Songs In Ordinary Time': [1997, 6],
 'The Meanest Thing To Say': [1997, 9],
 'A Lesson Before Dying': [1997, 9],
 'A Virtuous Woman': [1997, 10],
 'Ellen Foster': [1997, 10],
 'The Treasure Hunt': [1997, 12],
 'The Best Way to Play': [1997, 12],
 'Paradise': [1998, 1],
 'Here on Earth': [1998, 3],
 'Black and Blue': [1998, 4],
 'Breath, Eyes, Memory': [1998, 5],
 'I Know This Much Is True': [1998, 6],
 'What Looks Like Crazy on an Ordinary Day': [1998, 9],
 'Midwives': [1998, 10],
 'Where the Heart Is': [1998, 12],
 'Jewel': [1999, 1],
 'The Reader': [1999, 2],
 "The Pilot's Wife": [1999, 3],
 'White Oleander': [1999, 5],
 'Mother of Pearl': [1999, 6],
 'Tara Road': [1999, 9],
 'River, Cross My Heart': [1999, 10],
 'Vinegar Hill': [1999, 11],
 'A Map of the World': [1999, 12],
 'Gap Creek': [2000, 1],
 'Daughter of Fortune': [2000, 2],
 'Back Roads': [2000, 3],
 'The Bluest Eye': [2000, 4],
 'While I Was Gone': [2000, 5],
 'The Poisonwood Bible': [2000, 6],
 'Open House': [2000, 8],
 'Drowning Ruth': [2000, 9],
 'House of Sand and Fog': [2000, 11],
 'We Were the Mulvaneys': [2001, 1],
 'Icy Sparks': [2001, 3],
 'Stolen Lives: Twenty Years in a Desert Jail': [2001, 5],
 'Cane River': [2001, 6],
 'The Corrections': [2001, 9],
 'A Fine Balance': [2001, 11],
 'Fall on Your Knees': [2002, 1],
 'Sula': [2002, 4],
 'East of Eden': [2003, 6],
 'Cry, The Beloved Country': [2003, 9],
 'One Hundred Years of Solitude': [2004, 1],
 'The Heart Is a Lonely Hunter': [2004, 4],
 'Anna Karenina': [2004, 5],
 'The Good Earth': [2004, 9],
 'The Sound and the Fury, As I Lay Dying, Light in August': [2005, 6],
 'A Million Little Pieces': [2005, 9],
 'Night': [2006, 1],
 'The Measure of a Man: A Spiritual Autobiography': [2007, 1],
 'The Road': [2007, 3],
 'Middlesex': [2007, 6],
 'Love in the Time of Cholera': [2007, 10],
 'The Pillars of the Earth': [2007, 11],
 'A New Earth': [2008, 1],
 'The Story of Edgar Sawtelle': [2008, 9],
 "Say You're One of Them": [2009, 9],
 'Freedom': [2010, 9],
 'Great Expectations, A Tale of Two Cities': [2010, 12],
 'Wild: From Lost to Found on the Pacific Crest Trail': [2012, 6],
 'The Twelve Tribes of Hattie': [2012, 12],
 'The Invention of Wings': [2014, 1],
 'Ruby': [2015, 2],
 'The Underground Railroad': [2016, 8],
 'Love Warrior': [2016, 9],
 'Behold the Dreamers': [2017, 6],
 'An American Marriage': [2018, 2],
 'The Sun Does Shine': [2018, 6],
 'Becoming': [2018, 11],
 'The Water Dancer': [2019, 9],
 'Olive, Again': [2019, 11]}

In [15]:
######read good books csv and add dictionaries to it

file_path = "Resources/good_books.csv"

df = pd.read_csv(file_path)
df

,bookID,title,authors,average_rating,isbn,language_code,num_pages,ratings_count,text_reviews_count,publication_date
0,1,Harry Potter and the Half-Blood Prince (Harry ...,J.K. Rowling/Mary GrandPré,4.57,439785960,eng,652,2095690,27591,9/16/06
1,2,Harry Potter and the Order of the Phoenix (Har...,J.K. Rowling/Mary GrandPré,4.49,439358078,eng,870,2153167,29221,9/1/04
2,4,Harry Potter and the Chamber of Secrets (Harry...,J.K. Rowling,4.42,439554896,eng,352,6333,244,11/1/03
3,5,Harry Potter and the Prisoner of Azkaban (Harr...,J.K. Rowling/Mary GrandPré,4.56,043965548X,eng,435,2339585,36325,5/1/04
4,8,Harry Potter Boxed Set Books 1-5 (Harry Potte...,J.K. Rowling/Mary GrandPré,4.78,439682584,eng,2690,41428,164,9/13/04
...,...,...,...,...,...,...,...,...,...,...
11118,45631,Expelled from Eden: A William T. Vollmann Reader,William T. Vollmann/Larry McCaffery/Michael He...,4.06,1560254416,eng,512,156,20,12/21/04
11119,45633,You Bright and Risen Angels,William T. Vollmann,4.08,140110879,eng,635,783,56,12/1/88
11120,45634,The Ice-Shirt (Seven Dreams #1),William T. Vollmann,3.96,140131965,eng,415,820,95,8/1/93
11121,45639,Poor People,William T. Vollmann,3.72,60878827,eng,434,769,139,2/27/07
11122,45641,Las aventuras de Tom Sawyer,Mark Twain,3.91,8497646983,spa,272,113,12,5/28/06

In [16]:
#df[(df == pd.Series(oprah_dict)).all(1)]


df["Oprah Book Club (year, month)"] = df["title"].map(oprah_dict).fillna("N/A")

df

,bookID,title,authors,average_rating,isbn,language_code,num_pages,ratings_count,text_reviews_count,publication_date,"Oprah Book Club (year, month)"
0,1,Harry Potter and the Half-Blood Prince (Harry ...,J.K. Rowling/Mary GrandPré,4.57,439785960,eng,652,2095690,27591,9/16/06,N/A
1,2,Harry Potter and the Order of the Phoenix (Har...,J.K. Rowling/Mary GrandPré,4.49,439358078,eng,870,2153167,29221,9/1/04,N/A
2,4,Harry Potter and the Chamber of Secrets (Harry...,J.K. Rowling,4.42,439554896,eng,352,6333,244,11/1/03,N/A
3,5,Harry Potter and the Prisoner of Azkaban (Harr...,J.K. Rowling/Mary GrandPré,4.56,043965548X,eng,435,2339585,36325,5/1/04,N/A
4,8,Harry Potter Boxed Set Books 1-5 (Harry Potte...,J.K. Rowling/Mary GrandPré,4.78,439682584,eng,2690,41428,164,9/13/04,N/A
...,...,...,...,...,...,...,...,...,...,...,...
11118,45631,Expelled from Eden: A William T. Vollmann Reader,William T. Vollmann/Larry McCaffery/Michael He...,4.06,1560254416,eng,512,156,20,12/21/04,N/A
11119,45633,You Bright and Risen Angels,William T. Vollmann,4.08,140110879,eng,635,783,56,12/1/88,N/A
11120,45634,The Ice-Shirt (Seven Dreams #1),William T. Vollmann,3.96,140131965,eng,415,820,95,8/1/93,N/A
11121,45639,Poor People,William T. Vollmann,3.72,60878827,eng,434,769,139,2/27/07,N/A
11122,45641,Las aventuras de Tom Sawyer,Mark Twain,3.91,8497646983,spa,272,113,12,5/28/06,N/A

In [17]:
df.to_csv("Output/oprah.csv", index=False, header=True)